Revit 2027 API
BuiltInFailures.SteelElementFailures.SteelElementTaskNotFinished Property
 Advance Steel tasks not finished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementTaskNotFinished { get; }
Public Shared ReadOnly Property SteelElementTaskNotFinished As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementTaskNotFinished {
	FailureDefinitionId^ get ();
}
static member SteelElementTaskNotFinished : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace